package HomeWork2;

public class Task3 {
    /**
     * К вам пришел руководитель с задачей автоматизировать повышение зарплаты, а также провести расчет для следующих сотрудников:
     * Маша получает 67 760 рублей в месяц.
     * Денис получает 83 690 рублей в месяц.
     * Кристина получает 76 230 рублей в месяц.
     * Каждому нужно увеличить зарплату на 10% от текущей месячной. Дополнительно руководитель попросил посчитать разницу между годовым доходом с нынешней зарплатой и после повышения.
     * Выведите в консоль информацию по каждому сотруднику. Например: «Маша теперь получает ... рублей. Годовой доход вырос на ... рублей».
     */
    public static void main(String[] args) {
    int masha = 67760;
    int denis = 83690;
    int kristina = 76230;
    double newCashMasha = masha * 1.1;
    double newCashDenis = denis * 1.1;
    double newCashKristina = kristina * 1.1;
        System.out.println("Маша теперь получает: " + newCashMasha + " рублей. Годовой доход вырос на: " + (newCashMasha - masha) * 12 + "  рублей");
        System.out.println("Денис теперь получает: " + newCashDenis + " рублей. Годовой доход вырос на: " + (newCashDenis - denis) * 12 + "  рублей");
        System.out.println("Кристина теперь получает: " + newCashKristina + " рублей. Годовой доход вырос на: " + (newCashKristina - kristina) * 12 + "  рублей");
    }
}
