package HomeWork2;

public class Task8 {
    /**
     * 8) С помощью цикла while посчитайте, сколько месяцев потребуется,
     * чтобы накопить 2 459 000 рублей при условии, что первоначально мы имеем 0 рублей и готовы откладывать по 15 тысяч рублей.
     * Результат программы должен быть выведен в консоль с тем количеством месяцев,
     * которое необходимо для накопления данной суммы. Формат сообщения: «Месяц …, сумма накоплений равна … рублей» .
     */
    public static void main(String[] args) {
        int months = 0;
        int count = 0;
        while (count < 2459000) {
            count += 15000;
            months ++;
        }
        System.out.println("Месяцев: " + months + ", сумма накоплений равна: " + count + " рублей");
    }
}
